import 'normalize.css';
import './App.css';

function App() {
  return (
    <div className="App">
      <div className="logoArea">
        <img src="/images/logonav.png" alt="logo" />
      </div>
      <div className="container">
        <header className="header">
          <img src="/images/IMG_6116.jpg" alt="Inspiration photo" />
        </header>
        <nav className="nav">
          <div className="navbar">
            <ul className="listStyle">
              <li>
                <button>Profile</button>
              </li>
              <li>
                <button>Friends</button>
              </li>
              <li>
                <button>Messanger</button>
              </li>
              <li>
                <button>News</button>
              </li>
              <li>
                <button>Music</button>
              </li>
            </ul>
          </div>
          <footer className="footer">Footer</footer>
        </nav>
        <main className="main">
          Main
          <p>
            Название Ев. от Иоанна 10:1-18 Вступление ИЛЛЮ Во время второй
            мировой войны, когда американские солдаты захватили остров Сайпан,
            японцы приказали местным жителям покончить с собой, прыгнув со
            скалы. Но американские переводчики кричали в рупоры, что, если
            жители перейдут на сторону сша, их пощадят. Некоторые сделали это,
            но большинство прыгало. Сегодня люди в мире точно также реагируют на
            евангелие. СОДЕР Библия состоит из 66 книг, которые написал Бог
            через около 40 авторов. Апостол Иоанн один из библейских авторов
            отличается от других библейских авторов тем, что в своём евангелии и
            посланиях он всегда пишет то, зачем он пишет то, что пишет. Очень
            ярко это выражено в первом послании Иоанна где он сказал: Сие
            написал я вам, верующим во имя Сына Божия, дабы вы знали, что вы,
            веруя в Сына Божия, имеете жизнь вечную (1 Ин. 5:13) То есть мы
            видим, что послание написано для подлинно верующих людей, для того,
            чтобы они знали и были уверены, что верую в Сына Божия они абсолютно
            точно имеют вечную жизнь. И всё послание говорит о критериях вот
            этого спасённого настоящего верующего в контрасте с людьми, которые
            только заявляют на словах что они христиане, но в образе жизни,
            образе мышления, и в своих ценностях, они мирские, и не отличаются
            ничем от мира, и следовательно они не имеют жизни вечной, но гнев
            Божий пребывает на них. Но когда Иоанн пишет евангелие от Иоанна, то
            мы видим совсем другую цель апостола, которая записана 20 главе: Сие
            же написано, дабы вы уверовали, что Иисус есть Христос, Сын Божий,
            и, веруя, имели жизнь во имя Его (ев. от Ионна 20:31) В отличии от
            послания к настоящим верующим и утверждении в том, что они веруя уже
            имеют вечную жизнь, здесь апостол ставит цель чтобы человек прочитав
            это послание стал верующим в Сына Божьего и получил вечную жизнь.
            Так как это главный замысел апостола, то всё что написано в его
            евангелии будет подчиняться этому замыслу. Одной из глав которая
            призвана побудить человека к спасительной вере является 10 глава.
            ТЕЗИС На основании десятой главы мы посмотрим на две метафоры,
            которые описывают Иисуса как Спасителя. Да, здесь всего одна главная
            мысль, которая звучит так: Иисус Спаситель. Но она представлена под
            разными ракурсами в виде двух метафор, которые по-разному обогащают
            ту мысль что Иисус Спаситель. ЧИТ Ев. Ин. 10:1-18 ПЕРЕХ В евангелии
            от Иоанна Иисус говорит о Себе, как о Спасителе, более чем двумя
            метафорами, например Он говорит: «Я есмь путь» или «Я есмь жизнь»,
            «Я истина», «Я хлеб», «Я воскресение», «Я свет миру». И в десятой
            главе, мы прочитали о ещё двух метафорах, которые описывают Христа
            как Спасителя. И первая метафора в этом тексте… Содержание I. ИИСУС
            ЕСТЬ ДВЕРЬ ОВЦАМ ЧИТ Ин. 10:7-9 ОБЪЯСН Иисус называет себя дверью
            для овец. В первых шести стихах Иисус говорит притчу или большую
            аллегорию, в которой описывается обычная пастушеская практика
            первого века во времена Иисуса, которая для древних читателей была
            хорошая известна. Овцы находятся во дворе или загоне. По всей
            видимости Иисус говорит о довольно большом загоне, где несколько
            семей держали свои стада в одном дворе. В третьем стихе мы видим
            человека, который назван в тексте «придверник». Придверник, это
            нанятый человек, который охранял двери или ворота от посторонних и
            открывал их для тех, кто являлся пастухом одного из загонов. Воры и
            разбойники – это, банально, те люди, которые хотели легкой наживы и
            старались украсть овец. Так как было несколько стад в одном дворе,
            пастухам необходимо было как-то овец различать, разделять и не взять
            не свою, поэтому тогда когда они приходили к дверям (их кстати
            узнавал придверник охранник и открывал им ворота «ему придверник
            отворяет), и пастухи издавали свой собственный звук, или подавали
            голос каким-либо словом, и именно те овцы которые принадлежали
            своему пастуху выбегали к нему и пастух шёл впереди стада «и когда
            выведет овец, идёт перед ними; а овцы за ним идут, потому что знают
            голос его». А те, кто слышал голос чужого пастуха к нему не
            приближались. «За чужим же не идут, но бегут от него, потому что не
            знают чужого голоса. Это очень отличается от современного
            пастушества, где в основном овец гонят сзади, или вообще гоняет их
            пастушья собака, я даже слышал, что в Новой Зеландии овец пасут на
            вертолёте. Поэтому рассказ Иисуса был обычным повседневным бытом для
            людей того времени. Но после того, как он рассказал эту историю, в 7
            стихе Иисус делает заявление в духовном смысле: Я дверь овцам. Это
            первая метафора в 10 главе. Другими словами, Иисус сразу говорит о
            том, что если овцы хотят спасения, то Иисус та единственная дверь в
            загоне или во дворе, а лучше сказать, единственная дверь в мире для
            того, чтобы спастись. Образ двери говорит не только, что Иисус
            единственный путь ко спасению, но и о том, что нужно сделать
            переход, нужно войти в эту дверь, а не стоять и любоваться на неё,
            или проходить мимо неё, ища другие двери. Человек, который следует
            за Христом это человек, который вошёл в эту дверь. Стоит напомнить
            что Иисус обращается сейчас не к своим ученикам, но к фарисеям, так
            как 9 глава заканчивается на том что Иисус обращается к фарисеям. В
            оригинальном тексте нет глав и стихов, и мы видим, что 10 глава не
            начинается с нового места и времени, но продолжает непосредственно
            события 9 главы. Обратите внимание как 10 глава начинается со слов о
            том, как некоторые люди перелазят в других местах, но не входят
            дверью. Фарисеи, это были религиозные лидеры Израиля, и именно они в
            большинстве своём не принимали Иисуса как спасителя. В 8 стихе Иисус
            всё ещё обращается к фарисеям и говорит, что все, кто приходил до
            Него, в синодальном тексте «предо Мной», но украинский перевод более
            точно передаёт идею, что были люди до Него. И все, кто был до Него,
            это религиозные лидеры, которые вели людей к Богу, как они думали,
            то есть фарисеи, а также лжемессии, но именно Иисус есть настоящий
            мессия, и Тот Кто приведёт людей к Богу, 9-10 стихи: «Я есмь дверь:
            кто войдет Мною, тот спасётся, и войдёт, и выйдет, и пажить найдёт.
            Вор приходит (продолжает Иисус говорить к фарисеям) только для того,
            чтобы украсть, убить и пагубить. Я пришёл для того, чтобы имели
            жизнь и имели жизнь с избытком». ИЛЛЮ Знаете, именно во время войны,
            я действительно понял вот этот текст, что вор пришёл чтобы украсть,
            убить и пагубить. Я всегда думал ну почему сразу убить и пагубить, а
            не только украсть? Но как показала реальность, когда пришли русские
            солдаты в дома простых украинцев, они именно этим и занимались:
            грабили, убивали, и разрушали. В данном контексте, конечно, речь не
            идёт о физическом разрушении, Иисус говорит о духовных вещах приводя
            жизненные примеры. Здесь говорится что все те люди которые были
            лжемессиями, они не столько приводили людей к Богу, сколько
            заботились о собственной выгоде, они воры. Иисус же пришёл что Его
            овцы имели жизнь с избытком. Выражение «жизнь с избытком» в метафоре
            Иисуса про овец, означает толстых, довольных и благополучных овец, и
            их жизни ничего не угрожает. То есть, овцы это ученики Христа, и
            идея в том что каждый настоящий последователь Иисуса Христа не
            просто будет вечно жить, но и качество этой жизни будет невероятное,
            с избытком. ПРИМ Писание говорит: «нет другого имени под небом,
            данного человекам, которым надлежало бы нам спастись» (Деян. 4:12).
            Ни Аллах, ни Будда, ни Кришна, ни Дева Мария, ни какой-либо другой
            святой, ни деньги, не связи, ни ЗСУ, ни собственное я, ни все святые
            дела, и даже не десятки лет служения Богу. У человечества для
            спасения нет никакой другой личности или средства кроме Сына Божьего
            Иисуса Христа, именно Он есть дверь в небеса. Иногда молодые люди
            говорят «верь в себя» или «я верю только в себя». Но завтра прилетит
            рашистская ракета и попадёт в твой дом, и что твоя вера в себя тебе
            даст? Или короновирус заберёт твою жизнь, или авария, или здоровье,
            хотя здоровье в любом случае, так как все люди смертны, и что тогда
            эта «вера в себя» тебе даст? Кажется людям, что они ещё будут жить
            долго и счастливо в своих грехах, но коронавирус и война показыли,
            насколько быстро и радикально может всё поменяться в один момент.
            Итак, только Иисус есть та дверь, через которую Бог не советует
            войти, а повелевает: «покайтесь и веруйте в евангелие». Это первая
            метафора об Иисусе как о Спасителе. II. ИИСУС ЕСТЬ ПАСТЫРЬ ДОБРЫЙ
            ЧИТ Ин. 10:11 ОБЪЯСН Вторая метафора о Спасителе раскрывает то, что
            спасение овцам будет дано ценой собственной жизни пастуха. В этом и
            проявляется то, что он добрый пастырь, что Он «палагает жизнь Свою
            за овец». И в этом случае Он сравнивается с наёмником. Наёмник –
            это, обычный наёмный рабочий, которому платили деньги за пастушескую
            работу. Трудно сказать продолжает ли Иисус говорить о форисеях как о
            наёмниках, но в любом случае, наёмник сильно контрастирует с добрым
            пастухом, почему? Потому что наёмник в первую очередь заинтересован
            в собственной оплате труда, он не тот кто будет самоотверженно
            защищать овец перед волком. Смотрите 12 и 13 стихи: «12 А наемник,
            не пастырь, которому овцы не свои, видит приходящего волка, и
            оставляет овец, и бежит; и волк расхищает овец, и разгоняет их. 13 А
            наемник бежит, потому что наемник, и нерадит об овцах.» (Ин.
            10:12-13) Но Иисус есть добрый пастырь и Он знает Своих овец, а
            принадлежащие Ему овцы знают Его. Помните 3 стих? Там сказано, что
            Он каждую знает по имени. И точно также как Отец и Сын знают друг
            друга, так и спасённые овцы знают Христа лично, а Христос знает
            лично каждую Свою овцу. Эти слова были скорее обвинительными для
            фарисеев, так как Он им прямо заявляет о том, что они не знают Его
            так как знают овцы. Но даже если пастух не наёмник, действительно он
            заботится об овцах намного лучше, чем наёмник, потому что пастух
            любит своих овец, на какой пастух отдаст жизнь свою за овец? Так
            никто не делал. Но Иисус говорит метафору, в том, что Он за нас Свою
            жизнь отдаёт, а не за физических овечек. Мы также здесь видим, что
            Иисус предсказывает Свою смерть на Голгофском кресте, словами:
            «жизнь Мою палагаю за овец». Посмотрите на 16 стих, он раскрывает
            нам то, что овцы Иисуса находятся не только в Израиле, но и среди
            язычников, которые в Него уверуют. И здесь мы видим намёк на
            Церковь, в словах: «и будет одно стадо и один Пастырь». В 17 стихе
            Иисус уточняет и говорит, что Его жертва абсолютно добровольная,
            «никто не отнимает её у Меня, но Я Сам отдаю её». Всякий раз, когда
            мы как сегодня преломляем хлеб, мы возвещаем о Смерти Иисуса Христа,
            и к Его жертве мы причастники. И в послании к Коринфянам сказано,
            что церковь будет совершать вот это преломление до самого момента
            прихода Иисуса Христа на Землю судить мир. В 18 стихе вновь Иисус
            предсказывает, на этот раз Своё воскресение, «Имею власть отдать её
            и власть имею опять принять её». Итак, вторая метафора, которая
            описывает Христа как Спасителя – это то, что Он добрый Пастырь. Она
            раскрывает детали Спасения в том, что Пастух отдаёт жизнь свою за
            овец. ПРИМ - являемся ли мы «овечкой» Иисуса Христа? - знаком ли нам
            голос доброго пастыря? - следуем ли мы за голосом доброго пастыря?
            Заключение ПОВТОР Евангелие от Иоанна задумывалось с целью, чтобы
            человек прочитав это евангелие уверовал в Сына Божьего, и таким
            образом получил вечную жизнь. Иоанн не описывает все события,
            которые происходили с Христом, но он специально тщательно подбирает
            те ситуации, которые происходили, те диалоги, те метафоры, которые
            говорил Христос о Себе, чтобы описать с разных ракурсов Божье
            спасение, которое явилось во плоти. И мы увидели, что в первой
            метафоре главная идея заключается что только Он есть дверь, и нет
            другого какого-либо пути, а во второй метафоре мы увидели каким
            образом происходит спасение, ценой собственной жизни Сына Божьего на
            кресте. ЗАКЛЮЧЕНИЕ Друзья, в этой истории нет чего-то очень сложного
            для понимания, всё довольно просто. Евангелист Иоанн, Сам Иисус,
            призывают вас уверовать в Сына Божьего если вы ещё это не сделали, и
            тем самым вы получите дар вечной жизни с Богом. И пусть ваша вера
            проявится на деле, в вашем новом образе мышления и ценностях, как и
            подобает тем, кто следует за Христом. Если раньше вы жили, смотря
            вот так, а Бог сзади, то сейчас все ваши мысли должны развернуться в
            направлении к Богу, а сзади оставить мирские ценности. ЗАКЛ. ИЛЛЮ
            Как-то один из сотрудников сказал президенту Аврааму Линкольну такие
            слова: «Я очень хочу, чтобы Господь был на нашей стороне», на что
            Линкольн ответил: О, я совсем об том не беспокоюсь, вопрос лишь в
            том, находимся ли мы на стороне Господа? Если это так, то мы в
            полной безопасности. Аминь.
          </p>
        </main>
        <aside className="aside">Aside</aside>
      </div>
    </div>
  );
}

export default App;
